{
    "meta": {
      "theme": "kendall"
    },
    "basics": {
      "name": "Automation Expert",
      "phone": "0411021021",
      "label": "Senior Devops Engineer",
      "image": "https://avatars0.githubusercontent.com/u/416209?s=460&u=38f220a2c9c658141804f881c334c594eb1642ac&v=4",
      "summary": "I'm a full stack web developer who can build apps from the ground up. I've worked mostly at startups so I am used to wearing many hats. I am a very product focused developer who prioritizes user feedback first and foremost. I'm generally very flexible when investigating new roles.",
      "website": "https://automationexpert.us.kg.com",
      "url": "https://automationexpert.us.kg.com",
      "email": "admin@automationexpert.us.kg",
      "location": {
        "city": "Chennai",
        "countryCode": "IN"
      },
      "profiles": [
        {
          "username": "ajaxdavis",
          "url": "https://twitter.com/ajaxdavis",
          "network": "twitter"
        },
        {
          "url": "https://github.com/thomasdavis",
          "username": "thomasdavis",
          "network": "github"
        }
      ]
    },
    "certificates": [
      {
        "name": "Certified Kubernetes Administrator",
        "date": "2021-05-01",
        "issuer": "Cloud Native Computing Foundation",
        "url": "http://certificates.com/kubernetes"
      }
    ],
    "education": [
      {
        "institution": "University of Technology",
        "url": "http://universityoftechnology.com",
        "area": "Computer Science",
        "studyType": "Bachelor",
        "startDate": "2010-09-01",
        "endDate": "2014-06-30",
        "score": "3.8 GPA",
        "courses": [
          "CS301 - Operating Systems"
        ]
      }
    ],
    "references": [
      {
        "reference": "Thomas was hired as a lead developer and, upon the leaving of our co-founder took over as CTO of Earbits. Thomas is, hands down, one of those A Players you hear of companies dying to hire. He is incredibly smart, not just at code but about everything from classical music to Chinese language and culture. Thomas is great to work with and, as a well established contributor to open source projects and several successful ventures, commands the respect of engineers at all levels. I would suggest doing anything you can to have him on your team.",
        "name": "Joey Flores, Co-founder and CEO of Earbits, Inc."
      },
      {
        "reference": "I've had the great pleasure of working with Thomas for the past three years at Earbits, and on a few side projects. Two years ago our CTO left on a moment's notice, Thomas saved our company by quickly stepping up to fill this role. He has been with our company through thick and thin and made serious personal sacrifices in order to help the company during tough times. He is a phenomenal hacker and a true team player. Highly recommended!",
        "name": "Yotam Rosenbaum, SVP of Operations, Earbits, Inc."
      },
      {
        "reference": "Thomas is an extremely talented engineer with a very broad range of skills and experience. From being a thought leader in the front-end community via backbonetutorials.com and cdnjs.com, to designing and implementing the API for cdnjs.com, working with Thomas has been fantastic learning experience. Thomas is truly a full stack develop, and his work output is incredible. If there is any opportunity to work with Thomas, I take it. He is the definition of an A player.",
        "name": "Ryan Kirkman, Senior Software Engineer at Nerdwallet"
      },
      {
        "reference": "On Thomas Davis... Hire this guy. Do not be fooled. Incredibly capable and fast. Plays well with others. Unbelievable at front-end work end programming but that is just the start. Visionary. Hire him before I do.",
        "name": "Greg Davis"
      }
    ],
    "skills": [
      {
        "keywords": [
          "HTML / JSX",
          "SCSS / CSS / BEM / Styled Components",
          "Javascript / Typescript",
          "React / Next",
          "Redux / Apollo"
        ],
        "level": "Senior",
        "name": "Frontend"
      },
      {
        "keywords": [
          "Node",
          "Ruby",
          "Python",
          "Postgres",
          "Redis",
          "Serverless"
        ],
        "level": "Senior",
        "name": "Backend"
      },
      {
        "keywords": [
          "AWS",
          "G Cloud",
          "Heroku",
          "Caching"
        ],
        "level": "Senior",
        "name": "Devops"
      }
    ],
    "awards": [
      {
        "title": "Defender of the Internet",
        "awarder": "Fight For The Future",
        "date": "2014-10-02",
        "summary": "For my work against mass surveillance and building out civic tools for digital democracy."
      }
    ],
    "publications": [
      {
        "name": "Advanced JavaScript Techniques",
        "publisher": "Tech Books Publishing",
        "releaseDate": "2019-08-01",
        "url": "http://techbookspublishing.com/advanced-javascript",
        "summary": "A comprehensive guide to modern JavaScript development."
      }
    ],
    "volunteer": [
      {
        "organization": "Open Source Project",
        "position": "Contributor",
        "url": "http://opensourceproject.com",
        "startDate": "2016-01-01",
        "summary": "Contributing to open source projects to improve software quality.",
        "highlights": [
          "Fixed critical bugs and added new features.",
          "Mentored new contributors."
        ]
      }
    ],
    "work": [
      {
        "summary": "Over the past several years, I've worked at various roles and companies. Mostly early stage startups, doing full stack product development. ",
        "website": "https://lordajax.com/",
        "name": "Misc Companies",
        "location": "Melbourne",
        "position": "Product Engineer",
        "startDate": "2020-05-05",
        "highlights": [
          "React / Next",
          "Node / Laravel",
          "LLM's",
          "Diagrams / Canvas"
        ]
      },
      {
        "summary": "Tokenized is a Bitcoin wallet for issuing, managing and trading digital tokens. I built out the front end which was packaged as an electron app. It was a difficult frontend to build because we store the users keys locally and used them to sign transactions and contracts.",
        "website": "https://tokenized.com/",
        "name": "Tokenized",
        "location": "Melbourne",
        "position": "Senior Javascript Developer",
        "startDate": "2020-05-05",
        "endDate": "2021-05-05",
        "highlights": [
          "React",
          "Redux",
          "SCSS",
          "Product"
        ]
      },
      {
        "summary": "Ephox is a worldwide company who is heavily involved with the development of TinyMce and enterprise editors. My primary role included building front-end widgets and applications. Worked on a major product using Backbone.js as a base. Heavily involved in UI/UX design and wire-framing. Also spend a lot of time designing API specifications and documentation.",
        "website": "http://ephox.com",
        "name": "Ephox",
        "position": "Front-end Developer",
        "endDate": "2012-06-01",
        "startDate": "2011-01-01"
      }
    ],
    "projects": [
      {
        "highlights": [
          "This resume is built with JSON Resume",
          "Over 3000 stars on Github",
          "Community developed themes",
          "Tens of thousands of users"
        ],
        "description": "JSON Resume is a community driven open source initiative to create a JSON based standard for resumes. There is no reason why there can't be a common standard for writing a resume that can be extended with an ecosystem of open source tools.",
        "website": "http://jsonresume.org",
        "name": "JSON Resume",
        "startDate": "2014-04-01"
      },
      {
        "highlights": [
          "Millions of sites use the CDN in production",
          "Larger market share than Yahoo's, Microsoft's and Google's javascript content distribution networks",
          "We serve hundreds of billions request a month",
          "Contains over 3000 popular Javascript libraries",
          "Millions of developers visit the site per year"
        ],
        "description": "Following Google's CDN for jQuery, we decided to start a CDN for the less popular Javascript frameworks. The CDN is community moderated and open source on GitHub. We secured a partnership with Cloudflare who now supports the infrastructure.",
        "website": "http://www.cdnjs.com",
        "name": "Cdnjs",
        "startDate": "2011-01-08"
      }
    ],
    "languages": [
      {
        "language": "English",
        "fluency": "Native speaker"
      }
    ],
    "interests": [
      {
        "name": "Homelabbing",
        "keywords": [
          "Self-host",
          "RaspberryPi"
        ]
      },
      {
        "name": "Music",
        "keywords": [
          "Listening",
          "Singing"
        ]
      },
      {
        "name": "Open Source",
        "keywords": [
          "All of it"
        ]
      }
    ]
  }